app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "abc"], ["last_name", "xyz"], ["created_at", "2020-12-15 08:50:12.197908"], ["updated_at", "2020-12-15 08:50:12.197908"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save